In [3]:
import numpy as np
import pandas as pd

In [4]:
from datetime import datetime
now = datetime.now()
now

datetime.datetime(2022, 9, 28, 9, 56, 47, 884220)

In [5]:
now.year, now.month, now.day

(2022, 9, 28)

In [6]:
delta = datetime(2011, 1, 7) - datetime(2008, 6, 24, 8, 15)
delta

datetime.timedelta(days=926, seconds=56700)

In [7]:
stamp = datetime(2011, 1, 3)
str(stamp)

'2011-01-03 00:00:00'

In [8]:
longer_ts = pd.Series(np.random.standard_normal(1000),
                          index=pd.date_range("2000-01-01", periods=1000))
longer_ts

2000-01-01    0.627972
2000-01-02   -0.057919
2000-01-03   -1.389179
2000-01-04   -1.629257
2000-01-05    0.013616
                ...
2002-09-22    0.157144
2002-09-23   -0.419369
2002-09-24   -1.393279
2002-09-25   -0.979599
2002-09-26    0.384560
Freq: D, Length: 1000, dtype: float64

In [9]:
longer_ts["2001"]

2001-01-01   -0.808189
2001-01-02    0.179521
2001-01-03    0.758244
2001-01-04   -0.635457
2001-01-05    0.158956
                ...
2001-12-27    1.122167
2001-12-28   -0.362261
2001-12-29    0.512629
2001-12-30   -0.687570
2001-12-31   -0.760853
Freq: D, Length: 365, dtype: float64

In [10]:
longer_ts["2001-05"]

2001-05-01   -0.082180
2001-05-02   -0.262538
2001-05-03   -0.149158
2001-05-04   -3.361147
2001-05-05    1.098082
2001-05-06   -0.074843
2001-05-07    1.778504
2001-05-08   -1.006618
2001-05-09   -0.093810
2001-05-10   -0.130349
2001-05-11    0.038538
2001-05-12    0.672606
2001-05-13   -0.688332
2001-05-14   -0.038261
2001-05-15    0.954330
2001-05-16    2.085908
2001-05-17    0.695442
2001-05-18   -0.222181
2001-05-19   -0.538154
2001-05-20   -1.063896
2001-05-21   -0.088198
2001-05-22   -0.102436
2001-05-23    1.271713
2001-05-24   -1.323594
2001-05-25    0.234311
2001-05-26   -0.553403
2001-05-27   -1.173755
2001-05-28    0.704120
2001-05-29   -0.090193
2001-05-30    0.124484
2001-05-31    1.088546
Freq: D, dtype: float64

In [11]:
dates = pd.DatetimeIndex(["2000-01-01", "2000-01-02", "2000-01-02",
                              "2000-01-02", "2000-01-03"])
dup_ts = pd.Series(np.arange(5), index=dates)
dup_ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int32

In [13]:
grouped = dup_ts.groupby(level=0)
grouped.mean()

2000-01-01    0.0
2000-01-02    2.0
2000-01-03    4.0
dtype: float64

In [12]:
grouped.count()

2000-01-01    1
2000-01-02    3
2000-01-03    1
dtype: int64

In [13]:
from pandas.tseries.offsets import Hour, Minute

In [14]:
hour = Hour()
hour

In [15]:
four_hours = Hour(4)
four_hours

In [16]:
Hour(2) + Minute(30)

In [17]:
ts = pd.Series(np.random.standard_normal(4),
                   index=pd.date_range("2000-01-01", periods=4, freq="M"))
ts

2000-01-31   -0.455979
2000-02-29    1.908183
2000-03-31    0.722045
2000-04-30    1.273276
Freq: M, dtype: float64

In [18]:
ts.shift(2)

2000-01-31         NaN
2000-02-29         NaN
2000-03-31   -0.455979
2000-04-30    1.908183
Freq: M, dtype: float64

In [19]:
ts.shift(-2)

2000-01-31    0.722045
2000-02-29    1.273276
2000-03-31         NaN
2000-04-30         NaN
Freq: M, dtype: float64

In [20]:
ts.shift(2, freq="M")

2000-03-31   -0.455979
2000-04-30    1.908183
2000-05-31    0.722045
2000-06-30    1.273276
Freq: M, dtype: float64

In [21]:
ts.shift(3, freq="D")

2000-02-03   -0.455979
2000-03-03    1.908183
2000-04-03    0.722045
2000-05-03    1.273276
dtype: float64

In [22]:
from pandas.tseries.offsets import Day, MonthEnd

In [23]:
now = datetime(2011, 11, 17)

In [24]:
now + 3 * Day()

Timestamp('2011-11-20 00:00:00')

In [25]:
now + MonthEnd()

Timestamp('2011-11-30 00:00:00')

In [26]:
now + MonthEnd(2)

Timestamp('2011-12-31 00:00:00')

In [27]:
import pytz
pytz.common_timezones[-5:]

['US/Eastern', 'US/Hawaii', 'US/Mountain', 'US/Pacific', 'UTC']

In [28]:
tz = pytz.timezone("America/New_York")
tz

In [29]:
dates = pd.date_range("2012-03-09 09:30", periods=6)
ts = pd.Series(np.random.standard_normal(len(dates)), index=dates)
ts

2012-03-09 09:30:00    0.817231
2012-03-10 09:30:00    1.058164
2012-03-11 09:30:00   -0.094600
2012-03-12 09:30:00    0.920871
2012-03-13 09:30:00   -1.155678
2012-03-14 09:30:00   -2.274971
Freq: D, dtype: float64

In [31]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-09 09:30:00+00:00    0.817231
2012-03-10 09:30:00+00:00    1.058164
2012-03-11 09:30:00+00:00   -0.094600
2012-03-12 09:30:00+00:00    0.920871
2012-03-13 09:30:00+00:00   -1.155678
2012-03-14 09:30:00+00:00   -2.274971
Freq: D, dtype: float64

In [32]:
ts_utc.tz_convert("America/New_York")

2012-03-09 04:30:00-05:00    0.817231
2012-03-10 04:30:00-05:00    1.058164
2012-03-11 05:30:00-04:00   -0.094600
2012-03-12 05:30:00-04:00    0.920871
2012-03-13 05:30:00-04:00   -1.155678
2012-03-14 05:30:00-04:00   -2.274971
Freq: D, dtype: float64

In [33]:
p = pd.Period("2011", freq="A-DEC")
p

Period('2011', 'A-DEC')

In [34]:
p + 5

Period('2016', 'A-DEC')

In [35]:
periods = pd.period_range("2000-01-01", "2000-06-30", freq="M")
periods

PeriodIndex(['2000-01', '2000-02', '2000-03', '2000-04', '2000-05', '2000-06'], dtype='period[M]', freq='M')

In [36]:
dates = pd.date_range("2000-01-01", periods=3, freq="M")
ts = pd.Series(np.random.standard_normal(3), index=dates)
ts

2000-01-31    0.735633
2000-02-29    1.528580
2000-03-31    2.094422
Freq: M, dtype: float64

In [37]:
pts = ts.to_period()
pts

2000-01    0.735633
2000-02    1.528580
2000-03    2.094422
Freq: M, dtype: float64

In [38]:
dates = pd.date_range("2000-01-01", periods=100)
ts = pd.Series(np.random.standard_normal(len(dates)), index=dates)
ts

2000-01-01   -0.439558
2000-01-02    1.169794
2000-01-03   -0.819700
2000-01-04   -0.030236
2000-01-05   -0.678606
                ...
2000-04-05    2.268067
2000-04-06   -1.060021
2000-04-07    0.374235
2000-04-08    1.220228
2000-04-09   -0.220115
Freq: D, Length: 100, dtype: float64

In [39]:
ts.resample("M").mean()

2000-01-31   -0.037734
2000-02-29   -0.011982
2000-03-31    0.061097
2000-04-30    0.500093
Freq: M, dtype: float64

In [40]:
frame = pd.DataFrame(np.random.standard_normal((2, 4)),
                         index=pd.date_range("2000-01-01", periods=2,
                                             freq="W-WED"),
                         columns=["Colorado", "Texas", "New York", "Ohio"])
frame

            Colorado     Texas  New York      Ohio
2000-01-05 -0.982425  1.284436 -2.123302 -0.111519
2000-01-12 -1.167875  1.077839  0.726728  0.658309

In [41]:
df_daily = frame.resample("D").asfreq()
df_daily

            Colorado     Texas  New York      Ohio
2000-01-05 -0.982425  1.284436 -2.123302 -0.111519
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12 -1.167875  1.077839  0.726728  0.658309

In [42]:
frame.resample("D").ffill()

            Colorado     Texas  New York      Ohio
2000-01-05 -0.982425  1.284436 -2.123302 -0.111519
2000-01-06 -0.982425  1.284436 -2.123302 -0.111519
2000-01-07 -0.982425  1.284436 -2.123302 -0.111519
2000-01-08 -0.982425  1.284436 -2.123302 -0.111519
2000-01-09 -0.982425  1.284436 -2.123302 -0.111519
2000-01-10 -0.982425  1.284436 -2.123302 -0.111519
2000-01-11 -0.982425  1.284436 -2.123302 -0.111519
2000-01-12 -1.167875  1.077839  0.726728  0.658309